Descriptor:
  Name: Copilot_IR_Playbook-Device
  DisplayName:  Custom Plugin Powered by Defender XDR - Device IR Playbook
  Description:  Incident Response playbook for suspicious Windows device, powered by Defender XDR, developed by Bi Yue Xu.

SkillGroups:
  - Format: KQL
    Skills:
      - Name: ListPast3DayFilesDownloaded
        DisplayName: File - Lists Files Downloaded In Past 3 Days
        Description: Lists files downloaded to this device in the last 3 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view file download activities.
            Required: true
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | where DeviceName contains '{{devicename}}'
           | where Timestamp > ago(3d)
           | where isnotempty(FileOriginUrl) and ActionType == "FileCreated"
           | project Timestamp, DeviceName, ActionType, FileName, FolderPath, FileOriginUrl, InitiatingProcessFileName, InitiatingProcessAccountName, InitiatingProcessCommandLine
           | sort by Timestamp desc 
 
      - Name: ListFilesDownloaded
        DisplayName: File - Lists Files Downloaded Within a Timeframe
        Description: Lists files downloaded to this device in specific timeframe, in past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view file download activities.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where isnotempty(FileOriginUrl) and ActionType == "FileCreated"
           | project Timestamp, DeviceName, ActionType, FileName, FolderPath, FileOriginUrl, InitiatingProcessFileName, InitiatingProcessAccountName, InitiatingProcessCommandLine
           | sort by Timestamp desc 

      - Name: SensitiveFilesEvents
        DisplayName: File - Lists Sensitive Files Events On Device
        Description: Lists sensitive files events on this device in the last 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view sensitive file activities.
            Required: true
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | where DeviceName contains '{{devicename}}'
           | where Timestamp > ago(30d)
           | where IsAzureInfoProtectionApplied == "1" or isnotempty(SensitivityLabel)
           | project Timestamp, ActionType, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessAccountName, SHA256, IsAzureInfoProtectionApplied, SensitivityLabel, SensitivitySubLabel
           | sort by Timestamp desc  


      - Name: ProcessExecutionSummary
        DisplayName: Process - Summary Of Process Executions On Device Within a Timeframe
        Description: Summary of process executions on this device in specific timeframe, in past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view process execution activities.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceProcessEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | extend ProcessName = FileName, ProcessPath = FolderPath
           | summarize Count = count() by ProcessName, ProcessPath, AccountName
           | sort by ProcessName asc 

      - Name: ProcessExecutionDetails
        DisplayName: Process - Detailed Process Executions On Device Over A Short Period
        Description: Detailed process execution events within a brief period, e.g. an hour.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view process execution activities.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceProcessEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | extend ProcessName = FileName, ProcessPath = FolderPath
           | project Timestamp, DeviceName, ProcessName, ProcessPath, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessAccountName
           | sort by Timestamp desc 
           
      - Name: RDPConnectionToThisDevice
        DisplayName: Lateral Movement - RDP Connection To This Device
        Description: Inbound RDP connection initiated from Source IP to this device in past 30 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view RDP events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where ActionType == "RemoteDesktopConnection"
            | where Timestamp > ago(30d)
            | where DeviceName contains '{{devicename}}'
            | extend SourceIP = LocalIP
            | extend InternalPrivateIP = ipv4_is_private(SourceIP)
            | project Timestamp, ActionType, DeviceName, SourceIP, InternalPrivateIP
            | sort by Timestamp desc 

      - Name: LogonToDevice
        DisplayName: Lateral Movement - Logon Events To This Device
        Description: Logon events from other devices to this device in the last 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view logon events to this device. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceLogonEvents
            | where Timestamp > ago(7d)
            | where DeviceName contains '{{devicename}}'
            | extend DestinationDevice = DeviceName, SourceDevice = RemoteDeviceName, SourceIP = RemoteIP, SourceIPType = RemoteIPType
            | project Timestamp, SourceDevice, SourceIP, SourceIPType, DestinationDevice, ActionType, LogonType, AccountName, Protocol, IsLocalAdmin
            | sort by Timestamp desc 

      - Name: LogonToDeviceWithTimeframe
        DisplayName: Lateral Movement - Logon Events To This Device In Specific Timeframe
        Description: Logon events from other devices to this device in a specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view logon events to this device.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true          
        Settings:
          Target: Defender
          Template: |-
           DeviceFileEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | extend DestinationDevice = DeviceName, SourceDevice = RemoteDeviceName, SourceIP = RemoteIP, SourceIPType = RemoteIPType
           | project Timestamp, SourceDevice, SourceIP, SourceIPType, DestinationDevice, ActionType, LogonType, AccountName, Protocol, IsLocalAdmin
           | sort by Timestamp desc 

      - Name: DeviceOutboundNetworkEvents
        DisplayName: Network - Deivce Outbound Network Events In Specific Timeframe
        Description: Device outbound network events, including attempts and failed connections, in a specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view outbound network events.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceNetworkEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("ConnectionSuccess", "ConnectionAttempt", "ConnectionFailed", "ConnectionRequest")
           | summarize NetworkConnectionCount = count() by InitiatingProcessFileName, InitiatingProcessFolderPath, RemoteIP, RemoteUrl, RemotePort, Protocol 

      - Name: DeviceInboundNetworkEvents
        DisplayName: Network - Deivce Inbound Network Events In Specific Timeframe
        Description: Device inbound network events and attempts in a specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view inbound network events.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceNetworkEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("InboundConnectionAccepted", "InboundConnectionAcknowledged", "InboundConnectionAttempt")
           | summarize count() by ActionType, RemoteIP, RemotePort, LocalIP, LocalPort, Protocol          
 
      - Name: DevicelisteningPorts
        DisplayName: Network - Device Listening Ports In Specific Timeframe
        Description: Displays device listening ports at specific timeframe, in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view outbound network events.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceNetworkEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType == "ListeningConnectionCreated"
           | where LocalPort < 49151
           | project Timestamp, InitiatingProcessFileName, InitiatingProcessCommandLine, LocalPort
           | sort by LocalPort asc

      - Name: DeviceScheduledTask
        DisplayName: Device Events - Device Scheduled Task Events In Specific Timeframe
        Description: Scheduled task events seen on a device in a specific timeframe, in the last 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view scheduled tasks events.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("ScheduledTaskCreated", "ScheduledTaskDeleted", "ScheduledTaskUpdated")
           | project Timestamp, ActionType, InitiatingProcessAccountName, AdditionalFields, IsInitiatingProcessRemoteSession, IsProcessRemoteSession
           | sort by Timestamp desc 

      - Name: DeviceUserAccount
        DisplayName: Device Events - Device User Account Events In Specific Timeframe
        Description: User account events seen on a device in a specific timeframe, in the last 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view user account events.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("UserAccountCreated", "UserAccountDeleted", "UserAccountModified")
           | project Timestamp, ActionType, AccountName, AccountDomain, InitiatingProcessAccountName, AdditionalFields, IsInitiatingProcessRemoteSession, IsProcessRemoteSession
           | sort by Timestamp desc 

      - Name: DeviceUserAccountAddedOrRemovedFromLocalGroup
        DisplayName: Device Events - User Account Added Or Removed From Local Group
        Description: User account added or removed from local group on a device in a specific timeframe, in the last 30 days.
        Inputs:
          - Name: devicename
            Description: Provide the device name, e.g. vnevado-win10b, to view user account events.
            Required: true
          - Name: starttime
            Description: Provide a start time in yyyy-mm-dd-hh format, e.g. 2024-09-23-17
            Required: true  
          - Name: endtime
            Description: Provide an end time in yyyy-mm-dd-hh format, e.g. 2024-09-23-19
            Required: true            
        Settings:
          Target: Defender
          Template: |-
           DeviceEvents
           | extend StartTime = datetime('{{starttime}}')
           | extend EndTime = datetime('{{endtime}}')
           | where Timestamp between (StartTime .. EndTime)
           | where DeviceName contains '{{devicename}}'
           | where ActionType has_any ("UserAccountAddedToLocalGroup", "UserAccountRemovedFromLocalGroup")
           | extend GroupInfo = parse_json(AdditionalFields)
           | extend GroupName = GroupInfo.GroupName, GroupDomainName= GroupInfo.GroupDomainName
           | project Timestamp, ActionType, AccountSid, GroupName, GroupDomainName, InitiatingProcessAccountName, InitiatingProcessAccountDomain
           | sort by Timestamp desc 

      - Name: DeviceASRRules
        DisplayName: Suspicious Activities - ASR Rules Triggered
        Description: ASR rules that were triggered on this device in the past 30 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view ASR rules. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where Timestamp > ago(30d)
            | where ActionType startswith "Asr"
            | where DeviceName contains '{{devicename}}'
            | summarize ASR_Rule_Count = count() by ActionType

      - Name: DeviceAMSIEvents
        DisplayName: Suspicious Activities - Device ASMSI Script Detection
        Description: Script detection events from the Windows Antimalware Scan Interface (AMSI) in past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view AMSI events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where ActionType == "AmsiScriptDetection"
            | where Timestamp > ago(7d)
            | where DeviceName contains '{{devicename}}'
            | project Timestamp, InitiatingProcessFileName, SHA256, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessAccountName
            | sort by Timestamp desc 
 
      - Name: DeviceExploitGuard
        DisplayName: Suspicious Activities - Device Exploit Guard Event Triggered
        Description: Exploit Guard events detected on this device in past 30 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view Exploit Guard events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where ActionType startswith 'ExploitGuard' and ActionType !contains 'NetworkProtection'
            | where Timestamp > ago(30d)
            | where DeviceName contains '{{devicename}}'
            | project Timestamp, ActionType, InitiatingProcessFileName, InitiatingProcessSHA256, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessAccountName           
            | sort by Timestamp desc 
 
      - Name: DeviceNetworkProtection
        DisplayName: Suspicious Activities - Device Network Protection Events Triggered
        Description: Network Protection events triggered on this device in the past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view Network Protection events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where Timestamp > ago(7d)
            | where ActionType contains "ExploitGuardNetworkProtection"
            | where DeviceName contains '{{devicename}}'
            | project Timestamp, ActionType, InitiatingProcessFileName, InitiatingProcessCommandLine, InitiatingProcessAccountName, RemoteUrl

      - Name: DeviceTamperingAttempt
        DisplayName: Suspicious Activities - Device Tampering Attempts
        Description: Possible tampering attempts on this device in the past 7 days.
        Inputs:
          - Name: devicename
            Description: Please provide the device name, e.g. vnevado-win10b, to view possible tampering attempt events. 
            Required: true
        Settings:
          Target: Defender
          Template: |-
            DeviceEvents
            | where Timestamp > ago(7d)
            | where DeviceName contains '{{devicename}}'
            | where ActionType == "TamperingAttempt"
            | sort by Timestamp desc 